kongxiangji001/001_PCR_GD32E230/Template/main.c
/*!
    \file    main.c
    \brief   running LED

    \version 2025-08-08, V2.4.0, firmware for GD32E23x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32e23x.h"
#include "systick.h"
#include "owmy.h"
#include "gd32e23x_gpio.h"
#include "delay.h"
#include "T117_MTS4_OW.h"
#include "gd32e23x_usart.h"
#include "config.h"
#include <stdio.h>
#include "pid.h"
#include "ow2.h"

/* retarget printf to USART1 */
int fputc(int ch, FILE *f)
{
    usart_data_transmit(USART1, (uint8_t)ch);
    while (RESET == usart_flag_get(USART1, USART_FLAG_TBE)) {
    }
    return ch;
}

/* Heater struct and helper (top-level, not nested) */
typedef struct {
    PIDController pid;
    float setpoint;
    uint8_t duty;
} Heater_t;

/* 恒温区1档状态机 */
typedef enum {
    ZONE1_IDLE = 0,          /* 空闲状态 */
    ZONE1_HEATING,           /* 加热中 */
    ZONE1_HOLDING,           /* 恒温计时中 */
    ZONE1_COMPLETE,          /* 完成 */
    ZONE1_HEATING2,          /* 第二阶段加热中 (裂解区3档) */
    ZONE1_HOLDING2,          /* 第二阶段恒温计时中 (裂解区3档) */
    ZONE1_COMPLETE2          /* 第二阶段完成 (裂解区3档) */
} Zone1State_t;

/* 恒温区1档LED状态 */
typedef enum {
    LED_OFF = 0,
    LED_RED,
    LED_GREEN,
    LED_BLINK_RED_GREEN
} Zone1LEDState_t;

static uint8_t UpdateHeater(uint8_t channel, Heater_t *h, float (*getTempFunc)(void), float *outTemp)
{
    float temp = getTempFunc();
    float out = pid_compute(&h->pid, h->setpoint, temp);
    if (out < 0.0f) out = 0.0f;
    if (out > 100.0f) out = 100.0f;
    h->duty = (uint8_t)out;
    SetHeaterDuty(channel, h->duty);
    if (outTemp) *outTemp = temp;
    return h->duty;
}

/* Power LED / TIM5 blink control globals and prototypes */
volatile uint8_t red_blink_enable = 0;
volatile uint8_t green_blink_enable = 0;
volatile uint8_t red_steady_on = 0;
volatile uint8_t green_steady_on = 0;
volatile uint8_t blink_state = 0;

/* 恒温区1档控制变量 */
volatile Zone1State_t zone1_state = ZONE1_IDLE;
volatile uint8_t zone1_led_state = 0;  /* 0=LED_OFF, 1=LED_RED, 2=LED_GREEN, 3=LED_BLINK_RED_GREEN */
volatile uint32_t zone1_timer = 0;  /* 计时器，单位为100ms */
volatile uint8_t zone1_blink_count = 0;  /* 红绿交替闪烁计数 */
volatile uint8_t zone1_blink_state = 0;  /* 0=红灯, 1=绿灯 */

/* 恒温区2档控制变量 */
volatile Zone1State_t zone2_state = ZONE1_IDLE;
volatile uint8_t zone2_led_state = 0;  /* 0=LED_OFF, 1=LED_RED, 2=LED_GREEN, 3=LED_BLINK_RED_GREEN */
volatile uint32_t zone2_timer = 0;  /* 计时器，单位为100ms */
volatile uint8_t zone2_blink_count = 0;  /* 红绿交替闪烁计数 */
volatile uint8_t zone2_blink_state = 0;  /* 0=红灯, 1=绿灯 */

/* 裂解区1档控制变量 */
volatile Zone1State_t lysis1_state = ZONE1_IDLE;
volatile uint8_t lysis1_led_state = 0;  /* 0=LED_OFF, 1=LED_RED, 2=LED_GREEN, 3=LED_BLINK_RED_GREEN */
volatile uint32_t lysis1_timer = 0;  /* 计时器，单位为100ms */
volatile uint8_t lysis1_blink_count = 0;  /* 红绿交替闪烁计数 */
volatile uint8_t lysis1_blink_state = 0;  /* 0=红灯, 1=绿灯 */

/* 裂解区2档控制变量 */
volatile Zone1State_t lysis2_state = ZONE1_IDLE;
volatile uint8_t lysis2_led_state = 0;  /* 0=LED_OFF, 1=LED_RED, 2=LED_GREEN, 3=LED_BLINK_RED_GREEN */
volatile uint32_t lysis2_timer = 0;  /* 计时器，单位为100ms */
volatile uint8_t lysis2_blink_count = 0;  /* 红绿交替闪烁计数 */
volatile uint8_t lysis2_blink_state = 0;  /* 0=红灯, 1=绿灯 */

/* 裂解区3档控制变量 */
volatile Zone1State_t lysis3_state = ZONE1_IDLE;
volatile uint8_t lysis3_led_state = 0;  /* 0=LED_OFF, 1=LED_RED, 2=LED_GREEN, 3=LED_BLINK_RED_GREEN */
volatile uint32_t lysis3_timer = 0;  /* 计时器，单位为100ms */
volatile uint8_t lysis3_blink_count = 0;  /* 红绿交替闪烁计数 */
volatile uint8_t lysis3_blink_state = 0;  /* 0=红灯, 1=绿灯 */

static void PowerLEDs_Init(void);
static void Timer5_Init_ms(uint32_t ms);
static void UpdatePowerLEDs(float battery_voltage, uint8_t pa10);
static void UpdateZoneLEDs(void);
static void UpdateZone1State(float temp1, Heater_t *heater1);
static void UpdateZone2State(float temp1, Heater_t *heater1);
static void UpdateLysis1State(float temp2, Heater_t *heater2);
static void UpdateLysis2State(float temp2, Heater_t *heater2);
static void UpdateLysis3State(float temp2, Heater_t *heater2);

/*!
    \brief      main function
    \param[in]  none
    \param[out] none
    \retval     none
*/
/**
 * 主函数
 * 初始化系统定时器、IO接口、定时器2，并配置两个加热器的PID控制器
 * 在主循环中每100ms更新一次加热器状态并打印温度和占空比信息
 */
int main(void)
{
    systick_config();                    /* 初始化系统定时器 */
    IO_Config();                         /* initialize USART1, OW and LED IO */
    PowerLEDs_Init();                    /* 初始化 PA8/PA9/PA10 */
    Timer5_Init_ms(1000);                 /* TIM5 每 250ms 切换一次 blink_state */
    ADC_Config();                        /* configure ADC for battery voltage on PA1 */
    /* configure TIMER2 with desired PWM frequency (Hz) */
    Config_Timer2_Init(2000U);           /* 2kHz PWM */

    /* initialize two heaters with same default PID params */
    const float default_setpoint = 95.0f;
    const float Kp = 10.0f;
    const float Ki = 0.5f;
    const float Kd = 0.1f;
    Heater_t heater1, heater2;
    heater1.setpoint = default_setpoint;
    heater1.duty = 0;
    heater2.setpoint = default_setpoint;
    heater2.duty = 0;
    pid_init(&heater1.pid, Kp, Ki, Kd, 0.0f, 100.0f, 0.1f);
    pid_init(&heater2.pid, Kp, Ki, Kd, 0.0f, 100.0f, 0.1f);

