kongxiangji001/001_PCR_GD32E230/Template/main.c
    /* helper: update heater control is implemented at top-level */
    while (1) {
        float temp1 = 0.0f, temp2 = 0.0f, battery_voltage = 0.0f;
        uint8_t d1 = 0, d2 = 0;
        if (flag_100ms) {
            flag_100ms = 0;
            /* 更新恒温区1档状态 - 已移动到UpdateHeater之后 */
            /* 更新恒温区2档状态 - 已移动到UpdateHeater之后 */
            /* 根据恒温区1档状态设置加热片1的目标温度 */
            if (zone1_state == 1 || zone1_state == 2) {  /* ZONE1_HEATING || ZONE1_HOLDING */
                heater1.setpoint = 45.0f;  /* 更新加热片1的目标温度为45摄氏度 */
            } else if (zone2_state == 1 || zone2_state == 2) {  /* ZONE2_HEATING || ZONE2_HOLDING */
                heater1.setpoint = 45.0f;  /* 更新加热片1的目标温度为45摄氏度 */
            } else {
                heater1.setpoint = 0.0f;   /* 其他状态停止加热 */
            }
            
            /* 根据裂解区1档状态设置加热片2的目标温度 */
            if (lysis1_state == 1 || lysis1_state == 2) {  /* LYSIS1_HEATING || LYSIS1_HOLDING */
                heater2.setpoint = 95.0f;  /* 更新加热片2的目标温度为95摄氏度 */
            } else if (lysis2_state == 1 || lysis2_state == 2) {  /* LYSIS2_HEATING || LYSIS2_HOLDING */
                heater2.setpoint = 55.0f;  /* 更新加热片2的目标温度为55摄氏度 */
            } else if (lysis3_state == ZONE1_HEATING || lysis3_state == ZONE1_HOLDING || lysis3_state == ZONE1_HEATING2 || lysis3_state == ZONE1_HOLDING2) {  /* LYSIS3_HEATING || LYSIS3_HOLDING || LYSIS3_HEATING2 || LYSIS3_HOLDING2 */
                /* 裂解区3档需要两阶段加热：55度5分钟，95度2分钟 */
                if (lysis3_state == ZONE1_HEATING) {  /* LYSIS3_HEATING */
                    heater2.setpoint = 55.0f;  /* 第一阶段：55度 */
                } else if (lysis3_state == ZONE1_HEATING2 || lysis3_state == ZONE1_HOLDING2) {  /* LYSIS3_HEATING2 || LYSIS3_HOLDING2 */
                    heater2.setpoint = 95.0f;  /* 第二阶段：95度 */
                } else {  /* LYSIS3_HOLDING */
                    heater2.setpoint = 55.0f;  /* 第一阶段：55度 */
                }
            } else {
                heater2.setpoint = 0.0f;  /* 裂解区1、2、3档以外的情况，停止加热 */
            }
            d1 = UpdateHeater(2, &heater1, GetTemp, &temp1);  /* TIM2_CH2 -> heater1, DQ1 PB11 */
            d2 = UpdateHeater(3, &heater2, GetTemp2, &temp2); /* TIM2_CH3 -> heater2, DQ2 PA12 */
            battery_voltage = Read_Battery_Voltage();         /* 读取电池电压 */
            
            /* 更新恒温区1档状态 */
            UpdateZone1State(temp1, &heater1);
            /* 更新恒温区2档状态 */
            UpdateZone2State(temp1, &heater1);
            /* 更新裂解区1档状态 */
            UpdateLysis1State(temp2, &heater2);
            /* 更新裂解区2档状态 */
            UpdateLysis2State(temp2, &heater2);
            /* 更新裂解区3档状态 */
            UpdateLysis3State(temp2, &heater2);

            /* 读取 PA10 (充电状态)：0=充电中，1=充满/无充电 */
            uint8_t pa10 = gpio_input_bit_get(GPIOA, GPIO_PIN_10);

            /* 按新需求更新 LED 行为:
               充满电:  PA10 高 且 电压 > 3.12V -> PA9 持续绿灯
               充电中:  PA10 低 且 电压 < 3.12V -> PA9 绿灯闪烁
               快没电:  PA10 高 且 电压 < 2.3V   -> PA8 红灯闪烁
            */
            /* 更新 LED 显示电池状态 */
            UpdatePowerLEDs(battery_voltage, pa10);
            /* 更新 恒温区 / 裂解区 指示灯 */
            UpdateZoneLEDs();
            printf("%.2f, %d, %.2f, %d, %.2f\r\n", temp1, d1, temp2, d2, battery_voltage);
        }
    }
}

/* 初始化 PA8/PA9 输出 (推挽), PA10 输入上拉 */
static void PowerLEDs_Init(void)
{
    rcu_periph_clock_enable(RCU_GPIOA);

    /* PA8, PA9 输出推挽 (使用新的 gpio API) */
    gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_8 | GPIO_PIN_9);
    gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_8 | GPIO_PIN_9);

    /* PA10 输入，上拉 */
    gpio_mode_set(GPIOA, GPIO_MODE_INPUT, GPIO_PUPD_PULLUP, GPIO_PIN_10);

    /* 初始关闭 LED（高电平点亮） */
    gpio_bit_reset(GPIOA, GPIO_PIN_8 | GPIO_PIN_9);
}

/* 使用 TIMER5 产生 ms 级中断 (ms >= 1) */
static void Timer5_Init_ms(uint32_t ms)
{
    timer_parameter_struct timer_initpara;
    uint32_t pclk;

    rcu_periph_clock_enable(RCU_TIMER5);

    timer_deinit(TIMER5);
    timer_struct_para_init(&timer_initpara);

    pclk = rcu_clock_freq_get(CK_APB1);               /* APB1 时钟频率 */
    /* prescaler 使计数器时钟为 1kHz */
    timer_initpara.prescaler = (pclk / 1000U) - 1U;
    timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
    timer_initpara.counterdirection = TIMER_COUNTER_UP;
    timer_initpara.period = ms - 1U;
    timer_initpara.clockdivision = TIMER_CKDIV_DIV1;

    timer_init(TIMER5, &timer_initpara);

    timer_interrupt_enable(TIMER5, TIMER_INT_UP);
    nvic_irq_enable(TIMER5_IRQn, 2U);

    timer_enable(TIMER5);
}

/* 更新 LED 显示电池状态 */
static void UpdatePowerLEDs(float battery_voltage, uint8_t pa10)
{
    /* 按新需求更新 LED 行为:
       充满电:  PA10 高 且 电压 > 3.12V -> PA9 持续绿灯
       充电中:  PA10 低 且 电压 < 3.12V -> PA9 绿灯闪烁
       快没电:  PA10 高 且 电压 < 2.3V   -> PA8 红灯闪烁
    */
    red_blink_enable = 0;
    red_steady_on = 0;
    green_blink_enable = 0;
    green_steady_on = 0;

    if (pa10) { /* PA10 高 */
        if (battery_voltage > 3.12f) {
            /* 充满电：请求 PA9 持续绿灯（由 ISR 执行） */
            green_steady_on = 1;
        } else if (battery_voltage < 2.3f) {
            /* 快没电：PA8 红灯闪烁 */
            red_blink_enable = 1;
        }
    } else { /* PA10 低 -> 充电中 */
        if (battery_voltage < 3.12f) {
            /* 充电中且电压低于 3.12V：绿灯闪烁 */
            green_blink_enable = 1;
        } else if (battery_voltage >= 3.12f) {
            /* 充满电：请求 PA9 持续绿灯（由 ISR 执行） */
            green_steady_on = 1;
        }
    }
}

/* 更新 恒温区 与 裂解区 指示灯 状态
   恒温区输入: PA4(关), PA5(1档), PA7(2档) 低电平有效
   恒温区微动: PA6 低电平表示有试管
   恒温区输出:
     1档 绿 -> PA15 低, PB3 高
     1档 插管 红 -> PA15 高, PB3 低
     2档 绿 -> PB4 低, PB5 高
     2档 插管 红 -> PB4 高, PB5 低

   裂解区输入: PB7(1档), PB8(2档), PB9(3档) 低电平有效
   裂解区微动: PB6 低电平表示有试管
   裂解区输出:
     1档 绿 -> PB12 低, PB13 高
     1档 插管 红 -> PB12 高, PB13 低
     2档 绿 -> PB14 低, PB15 高
     2档 插管 红 -> PB14 高, PB15 低
     3档 绿 -> PB12/14 低, PB13/15 高
     3档 插管 红 -> PB12/14 高, PB13/15 低
*/
static void UpdateZoneLEDs(void)
{
    uint8_t pa4 = gpio_input_bit_get(GPIOA, GPIO_PIN_4);
    uint8_t pa5 = gpio_input_bit_get(GPIOA, GPIO_PIN_5);
    uint8_t pa7 = gpio_input_bit_get(GPIOA, GPIO_PIN_7);
    uint8_t pa6 = gpio_input_bit_get(GPIOA, GPIO_PIN_6); /* 恒温区微动 */
    uint8_t pb6 = gpio_input_bit_get(GPIOB, GPIO_PIN_6); /* 裂解区微动 */

    /* 先将恒温区相关输出置为默认 OFF (reset) */
    gpio_bit_reset(GPIOA, GPIO_PIN_15);
    gpio_bit_reset(GPIOB, GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5);

    /* 恒温区: 优先判断 1 档 -> 2 档 -> 关/无动作 */
    if (pa5 == 0) {
        /* 1 档 */
        if (pa6 == 0) {
            /* 插管: 根据恒温区1档状态控制LED */
            if (zone1_state == 3) {  /* ZONE1_COMPLETE */
                /* 完成状态: 根据LED状态控制 */
                if (zone1_led_state == 1) {  /* LED_RED */
                    /* 红灯: PA15 高, PB3 低 */
                    gpio_bit_set(GPIOA, GPIO_PIN_15);
                    gpio_bit_reset(GPIOB, GPIO_PIN_3);
                } else if (zone1_led_state == 2) {  /* LED_GREEN */
                    /* 绿灯: PA15 低, PB3 高 */
                    gpio_bit_reset(GPIOA, GPIO_PIN_15);
                    gpio_bit_set(GPIOB, GPIO_PIN_3);
                } else if (zone1_led_state == 3) {  /* LED_BLINK_RED_GREEN */
                    /* 红绿交替闪烁 */
                    if (zone1_blink_state == 0) {
                        /* 红灯: PA15 高, PB3 低 */
                        gpio_bit_set(GPIOA, GPIO_PIN_15);
                        gpio_bit_reset(GPIOB, GPIO_PIN_3);
                    } else {
                        /* 绿灯: PA15 低, PB3 高 */
                        gpio_bit_reset(GPIOA, GPIO_PIN_15);
                        gpio_bit_set(GPIOB, GPIO_PIN_3);
                    }
                } else {
                    /* 默认: 红灯: PA15 高, PB3 低 */
                    gpio_bit_set(GPIOA, GPIO_PIN_15);
                    gpio_bit_reset(GPIOB, GPIO_PIN_3);
                }
            } else {
                /* 其他状态: 红灯: PA15 高, PB3 低 */
                gpio_bit_set(GPIOA, GPIO_PIN_15);
                gpio_bit_reset(GPIOB, GPIO_PIN_3);
            }
        } else {
            /* 未插管 -> 绿灯: PA15 低, PB3 高 */
            gpio_bit_reset(GPIOA, GPIO_PIN_15);
            gpio_bit_set(GPIOB, GPIO_PIN_3);
        }
    } else if (pa7 == 0) {
        /* 2 档 */
        if (pa6 == 0) {
            /* 插管: 根据恒温区2档状态控制LED */
            if (zone2_state == 3) {  /* ZONE2_COMPLETE */
                /* 完成状态: 根据LED状态控制 */
                if (zone2_led_state == 1) {  /* LED_RED */
                    /* 红灯: PB4 高, PB5 低 */
                    gpio_bit_set(GPIOB, GPIO_PIN_4);
                    gpio_bit_reset(GPIOB, GPIO_PIN_5);
                } else if (zone2_led_state == 2) {  /* LED_GREEN */
                    /* 绿灯: PB4 低, PB5 高 */
                    gpio_bit_reset(GPIOB, GPIO_PIN_4);
                    gpio_bit_set(GPIOB, GPIO_PIN_5);
                } else if (zone2_led_state == 3) {  /* LED_BLINK_RED_GREEN */
                    /* 红绿交替闪烁 */
                    if (zone2_blink_state == 0) {
                        /* 红灯: PB4 高, PB5 低 */
                        gpio_bit_set(GPIOB, GPIO_PIN_4);
                        gpio_bit_reset(GPIOB, GPIO_PIN_5);
                    } else {
                        /* 绿灯: PB4 低, PB5 高 */
                        gpio_bit_reset(GPIOB, GPIO_PIN_4);
                        gpio_bit_set(GPIOB, GPIO_PIN_5);
                    }
                } else {
                    /* 默认: 红灯: PB4 高, PB5 低 */
                    gpio_bit_set(GPIOB, GPIO_PIN_4);
                    gpio_bit_reset(GPIOB, GPIO_PIN_5);
                }
            } else {
                /* 其他状态: 红灯: PB4 高, PB5 低 */
                gpio_bit_set(GPIOB, GPIO_PIN_4);
                gpio_bit_reset(GPIOB, GPIO_PIN_5);
            }
        } else {
            /* 未插管 -> 绿灯: PB4 低, PB5 高 */
            gpio_bit_reset(GPIOB, GPIO_PIN_4);
            gpio_bit_set(GPIOB, GPIO_PIN_5);
        }
    } else {
        /* OFF 或其他: 保持默认关闭 */
        (void)pa4; /* 未使用的变量占位，PA4 表示关 */
    }

