kongxiangji001/001_PCR_GD32E230/Template/main.c
    /* 裂解区: 先清除输出，再根据档位设置 */
    gpio_bit_reset(GPIOB, GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15);

    if (gpio_input_bit_get(GPIOB, GPIO_PIN_7) == 0) {
        /* 裂解区 1 档 */
        if (pb6 == 0) {
            /* 插管: 根据裂解区1档状态控制LED */
            if (lysis1_state == 3) {  /* LYSIS1_COMPLETE */
                /* 完成状态: 根据LED状态控制 */
                if (lysis1_led_state == 1) {  /* LED_RED */
                    /* 红灯: PB12 高, PB13 低 */
                    gpio_bit_set(GPIOB, GPIO_PIN_12);
                    gpio_bit_reset(GPIOB, GPIO_PIN_13);
                } else if (lysis1_led_state == 2) {  /* LED_GREEN */
                    /* 绿灯: PB12 低, PB13 高 */
                    gpio_bit_reset(GPIOB, GPIO_PIN_12);
                    gpio_bit_set(GPIOB, GPIO_PIN_13);
                } else if (lysis1_led_state == 3) {  /* LED_BLINK_RED_GREEN */
                    /* 红绿交替闪烁 */
                    if (lysis1_blink_state == 0) {
                        /* 红灯: PB12 高, PB13 低 */
                        gpio_bit_set(GPIOB, GPIO_PIN_12);
                        gpio_bit_reset(GPIOB, GPIO_PIN_13);
                    } else {
                        /* 绿灯: PB12 低, PB13 高 */
                        gpio_bit_reset(GPIOB, GPIO_PIN_12);
                        gpio_bit_set(GPIOB, GPIO_PIN_13);
                    }
                } else {
                    /* 默认: 红灯: PB12 高, PB13 低 */
                    gpio_bit_set(GPIOB, GPIO_PIN_12);
                    gpio_bit_reset(GPIOB, GPIO_PIN_13);
                }
            } else {
                /* 其他状态: 红灯: PB12 高, PB13 低 */
                gpio_bit_set(GPIOB, GPIO_PIN_12);
                gpio_bit_reset(GPIOB, GPIO_PIN_13);
            }
        } else {
            /* 未插管 -> 绿灯: PB12 低, PB13 高 */
            gpio_bit_reset(GPIOB, GPIO_PIN_12);
            gpio_bit_set(GPIOB, GPIO_PIN_13);
        }
    } else if (gpio_input_bit_get(GPIOB, GPIO_PIN_8) == 0) {
        /* 裂解区 2 档 */
        if (pb6 == 0) {
            /* 插管: 根据裂解区2档状态控制LED */
            if (lysis2_state == 3) {  /* LYSIS2_COMPLETE */
                /* 完成状态: 根据LED状态控制 */
                if (lysis2_led_state == 1) {  /* LED_RED */
                    /* 红灯: PB14 高, PB15 低 */
                    gpio_bit_set(GPIOB, GPIO_PIN_14);
                    gpio_bit_reset(GPIOB, GPIO_PIN_15);
                } else if (lysis2_led_state == 2) {  /* LED_GREEN */
                    /* 绿灯: PB14 低, PB15 高 */
                    gpio_bit_reset(GPIOB, GPIO_PIN_14);
                    gpio_bit_set(GPIOB, GPIO_PIN_15);
                } else if (lysis2_led_state == 3) {  /* LED_BLINK_RED_GREEN */
                    /* 红绿交替闪烁 */
                    if (lysis2_blink_state == 0) {
                        /* 红灯: PB14 高, PB15 低 */
                        gpio_bit_set(GPIOB, GPIO_PIN_14);
                        gpio_bit_reset(GPIOB, GPIO_PIN_15);
                    } else {
                        /* 绿灯: PB14 低, PB15 高 */
                        gpio_bit_reset(GPIOB, GPIO_PIN_14);
                        gpio_bit_set(GPIOB, GPIO_PIN_15);
                    }
                } else {
                    /* 默认: 红灯: PB14 高, PB15 低 */
                    gpio_bit_set(GPIOB, GPIO_PIN_14);
                    gpio_bit_reset(GPIOB, GPIO_PIN_15);
                }
            } else {
                /* 其他状态: 红灯: PB14 高, PB15 低 */
                gpio_bit_set(GPIOB, GPIO_PIN_14);
                gpio_bit_reset(GPIOB, GPIO_PIN_15);
            }
        } else {
            /* 未插管 -> 绿灯: PB14 低, PB15 高 */
            gpio_bit_reset(GPIOB, GPIO_PIN_14);
            gpio_bit_set(GPIOB, GPIO_PIN_15);
        }
    } else if (gpio_input_bit_get(GPIOB, GPIO_PIN_9) == 0) {
        /* 裂解区 3 档 (两组同时) */
        if (pb6 == 0) {
            /* 插管: 根据裂解区3档状态控制LED */
            if (lysis3_state == ZONE1_COMPLETE2) {  /* LYSIS3_COMPLETE */
                /* 完成状态: 根据LED状态控制 */
                if (lysis3_led_state == 1) {  /* LED_RED */
                    /* 红灯: PB12 高, PB13 低, PB14 高, PB15 低 */
                    gpio_bit_set(GPIOB, GPIO_PIN_12);
                    gpio_bit_reset(GPIOB, GPIO_PIN_13);
                    gpio_bit_set(GPIOB, GPIO_PIN_14);
                    gpio_bit_reset(GPIOB, GPIO_PIN_15);
                } else if (lysis3_led_state == 2) {  /* LED_GREEN */
                    /* 绿灯: PB12 低, PB13 高, PB14 低, PB15 高 */
                    gpio_bit_reset(GPIOB, GPIO_PIN_12);
                    gpio_bit_set(GPIOB, GPIO_PIN_13);
                    gpio_bit_reset(GPIOB, GPIO_PIN_14);
                    gpio_bit_set(GPIOB, GPIO_PIN_15);
                } else if (lysis3_led_state == 3) {  /* LED_BLINK_RED_GREEN */
                    /* 红绿交替闪烁 */
                    if (lysis3_blink_state == 0) {
                        /* 红灯: PB12 高, PB13 低, PB14 高, PB15 低 */
                        gpio_bit_set(GPIOB, GPIO_PIN_12);
                        gpio_bit_reset(GPIOB, GPIO_PIN_13);
                        gpio_bit_set(GPIOB, GPIO_PIN_14);
                        gpio_bit_reset(GPIOB, GPIO_PIN_15);
                    } else {
                        /* 绿灯: PB12 低, PB13 高, PB14 低, PB15 高 */
                        gpio_bit_reset(GPIOB, GPIO_PIN_12);
                        gpio_bit_set(GPIOB, GPIO_PIN_13);
                        gpio_bit_reset(GPIOB, GPIO_PIN_14);
                        gpio_bit_set(GPIOB, GPIO_PIN_15);
                    }
                } else {
                    /* 默认: 红灯: PB12 高, PB13 低, PB14 高, PB15 低 */
                    gpio_bit_set(GPIOB, GPIO_PIN_12);
                    gpio_bit_reset(GPIOB, GPIO_PIN_13);
                    gpio_bit_set(GPIOB, GPIO_PIN_14);
                    gpio_bit_reset(GPIOB, GPIO_PIN_15);
                }
            } else {
                /* 其他状态: 红灯: PB12 高, PB13 低, PB14 高, PB15 低 */
                gpio_bit_set(GPIOB, GPIO_PIN_12);
                gpio_bit_reset(GPIOB, GPIO_PIN_13);
                gpio_bit_set(GPIOB, GPIO_PIN_14);
                gpio_bit_reset(GPIOB, GPIO_PIN_15);
            }
        } else {
            /* 未插管 -> 绿灯: PB12 低, PB13 高, PB14 低, PB15 高 */
            gpio_bit_reset(GPIOB, GPIO_PIN_12);
            gpio_bit_set(GPIOB, GPIO_PIN_13);
            gpio_bit_reset(GPIOB, GPIO_PIN_14);
            gpio_bit_set(GPIOB, GPIO_PIN_15);
        }
    }
}

/* 更新恒温区1档状态 */
static void UpdateZone1State(float temp1, Heater_t *heater1)
{
    uint8_t pa5 = gpio_input_bit_get(GPIOA, GPIO_PIN_5);
    uint8_t pa6 = gpio_input_bit_get(GPIOA, GPIO_PIN_6);
    
