kongxiangji001/001_PCR_GD32E230/Template/main.c
    /* 检查是否处于1档且有试管 */
    if (pa5 == 0 && pa6 == 0) {
        switch (zone1_state) {
            case 0:  /* ZONE1_IDLE */
                /* 空闲状态，开始加热 */
                zone1_state = 1;  /* ZONE1_HEATING */
                zone1_timer = 0;
                zone1_led_state = 1;  /* LED_RED */
                break;
                
            case 1:  /* ZONE1_HEATING */
                /* 加热中，检查是否到达目标温度 */
                if (temp1 >= 44.0f) {  /* 到达44度认为接近目标温度 */
                    zone1_state = 2;  /* ZONE1_HOLDING */
                    zone1_timer = 0;
                }
                break;
                
            case 2:  /* ZONE1_HOLDING */
                /* 恒温计时中，每100ms增加一次计数 */
                zone1_timer++;
                /* 10分钟 = 600秒 = 6000个100ms */
                if (zone1_timer >= 6000) {
                    /* 计时结束，停止加热 */
                    zone1_state = 3;  /* ZONE1_COMPLETE */
                    zone1_led_state = 3;  /* LED_BLINK_RED_GREEN */
                    zone1_blink_count = 0;
                    zone1_blink_state = 0;
                }
                break;
                
            case 3:  /* ZONE1_COMPLETE */
                /* 完成状态，保持LED状态 */
                break;
                
            default:
                zone1_state = 0;  /* ZONE1_IDLE */
                break;
        }
    } else {
        /* 不在1档或没有试管，重置状态 */
        zone1_state = 0;  /* ZONE1_IDLE */
        zone1_led_state = 0;  /* LED_OFF */
        zone1_timer = 0;
        zone1_blink_count = 0;
        zone1_blink_state = 0;
    }
}

/* 更新恒温区2档状态 */
static void UpdateZone2State(float temp1, Heater_t *heater1)
{
    uint8_t pa7 = gpio_input_bit_get(GPIOA, GPIO_PIN_7);
    uint8_t pa6 = gpio_input_bit_get(GPIOA, GPIO_PIN_6);
    
    /* 检查是否处于2档且有试管 */
    if (pa7 == 0 && pa6 == 0) {
        switch (zone2_state) {
            case 0:  /* ZONE2_IDLE */
                /* 空闲状态，开始加热 */
                zone2_state = 1;  /* ZONE2_HEATING */
                zone2_timer = 0;
                zone2_led_state = 1;  /* LED_RED */
                break;
                
            case 1:  /* ZONE2_HEATING */
                /* 加热中，检查是否到达目标温度 */
                if (temp1 >= 44.0f) {  /* 到达44度认为接近目标温度 */
                    zone2_state = 2;  /* ZONE2_HOLDING */
                    zone2_timer = 0;
                }
                break;
                
            case 2:  /* ZONE2_HOLDING */
                /* 恒温计时中，每100ms增加一次计数 */
                zone2_timer++;
                /* 15分钟 = 900秒 = 9000个100ms */
                if (zone2_timer >= 9000) {
                    /* 计时结束，停止加热 */
                    zone2_state = 3;  /* ZONE2_COMPLETE */
                    zone2_led_state = 3;  /* LED_BLINK_RED_GREEN */
                    zone2_blink_count = 0;
                    zone2_blink_state = 0;
                }
                break;
                
            case 3:  /* ZONE2_COMPLETE */
                /* 完成状态，保持LED状态 */
                break;
                
            default:
                zone2_state = 0;  /* ZONE2_IDLE */
                break;
        }
    } else {
        /* 不在2档或没有试管，重置状态 */
        zone2_state = 0;  /* ZONE2_IDLE */
        zone2_led_state = 0;  /* LED_OFF */
        zone2_timer = 0;
        zone2_blink_count = 0;
        zone2_blink_state = 0;
    }
}

/* 更新裂解区1档状态 */
static void UpdateLysis1State(float temp2, Heater_t *heater2)
{
    uint8_t pb7 = gpio_input_bit_get(GPIOB, GPIO_PIN_7);
    uint8_t pb6 = gpio_input_bit_get(GPIOB, GPIO_PIN_6);
    
    /* 检查是否处于1档且有试管 */
    if (pb7 == 0 && pb6 == 0) {
        switch (lysis1_state) {
            case 0:  /* LYSIS1_IDLE */
                /* 空闲状态，开始加热 */
                lysis1_state = 1;  /* LYSIS1_HEATING */
                lysis1_timer = 0;
                lysis1_led_state = 1;  /* LED_RED */
                break;
                
            case 1:  /* LYSIS1_HEATING */
                /* 加热中，检查是否到达目标温度 */
                if (temp2 >= 94.0f) {  /* 到达94度认为接近目标温度 */
                    lysis1_state = 2;  /* LYSIS1_HOLDING */
                    lysis1_timer = 0;
                }
                break;
                
            case 2:  /* LYSIS1_HOLDING */
                /* 恒温计时中，每100ms增加一次计数 */
                lysis1_timer++;
                /* 5分钟 = 300秒 = 3000个100ms */
                if (lysis1_timer >= 3000) {
                    /* 计时结束，停止加热 */
                    lysis1_state = 3;  /* LYSIS1_COMPLETE */
                    lysis1_led_state = 3;  /* LED_BLINK_RED_GREEN */
                    lysis1_blink_count = 0;
                    lysis1_blink_state = 0;
                }
                break;
                
            case 3:  /* LYSIS1_COMPLETE */
                /* 完成状态，保持LED状态 */
                break;
                
            default:
                lysis1_state = 0;  /* LYSIS1_IDLE */
                break;
        }
    } else {
        /* 不在1档或没有试管，重置状态 */
        lysis1_state = 0;  /* LYSIS1_IDLE */
        lysis1_led_state = 0;  /* LED_OFF */
        lysis1_timer = 0;
        lysis1_blink_count = 0;
        lysis1_blink_state = 0;
    }
}

/* 更新裂解区2档状态 */
static void UpdateLysis2State(float temp2, Heater_t *heater2)
{
    uint8_t pb8 = gpio_input_bit_get(GPIOB, GPIO_PIN_8);
    uint8_t pb6 = gpio_input_bit_get(GPIOB, GPIO_PIN_6);
    
    /* 检查是否处于2档且有试管 */
    if (pb8 == 0 && pb6 == 0) {
        switch (lysis2_state) {
            case 0:  /* LYSIS2_IDLE */
                /* 空闲状态，开始加热 */
                lysis2_state = 1;  /* LYSIS2_HEATING */
                lysis2_timer = 0;
                lysis2_led_state = 1;  /* LED_RED */
                break;
                
            case 1:  /* LYSIS2_HEATING */
                /* 加热中，检查是否到达目标温度 */
                if (temp2 >= 54.0f) {  /* 到达54度认为接近目标温度 */
                    lysis2_state = 2;  /* LYSIS2_HOLDING */
                    lysis2_timer = 0;
                }
                break;
                
            case 2:  /* LYSIS2_HOLDING */
                /* 恒温计时中，每100ms增加一次计数 */
                lysis2_timer++;
                /* 5分钟 = 300秒 = 3000个100ms */
                if (lysis2_timer >= 3000) {
                    /* 计时结束，停止加热 */
                    lysis2_state = 3;  /* LYSIS2_COMPLETE */
                    lysis2_led_state = 3;  /* LED_BLINK_RED_GREEN */
                    lysis2_blink_count = 0;
                    lysis2_blink_state = 0;
                }
                break;
                
            case 3:  /* LYSIS2_COMPLETE */
                /* 完成状态，保持LED状态 */
                break;
                
            default:
                lysis2_state = 0;  /* LYSIS2_IDLE */
                break;
        }
    } else {
        /* 不在2档或没有试管，重置状态 */
        lysis2_state = 0;  /* LYSIS2_IDLE */
        lysis2_led_state = 0;  /* LED_OFF */
        lysis2_timer = 0;
        lysis2_blink_count = 0;
        lysis2_blink_state = 0;
    }
}

/* 更新裂解区3档状态 */
static void UpdateLysis3State(float temp2, Heater_t *heater2)
{
    uint8_t pb9 = gpio_input_bit_get(GPIOB, GPIO_PIN_9);
    uint8_t pb6 = gpio_input_bit_get(GPIOB, GPIO_PIN_6);
    
    /* 检查是否处于3档且有试管 */
    if (pb9 == 0 && pb6 == 0) {
        switch (lysis3_state) {
            case ZONE1_IDLE:  /* LYSIS3_IDLE */
                /* 空闲状态，开始加热 */
                lysis3_state = ZONE1_HEATING;  /* LYSIS3_HEATING */
                lysis3_timer = 0;
                lysis3_led_state = 1;  /* LED_RED */
                break;
                
            case ZONE1_HEATING:  /* LYSIS3_HEATING */
                /* 加热中，检查是否到达目标温度 */
                if (temp2 >= 54.0f) {  /* 到达54度认为接近目标温度 */
                    lysis3_state = ZONE1_HOLDING;  /* LYSIS3_HOLDING */
                    lysis3_timer = 0;
                }
                break;
                
