kongxiangji001/001_PCR_GD32E230/Template/main.c
            case ZONE1_HOLDING:  /* LYSIS3_HOLDING */
                /* 恒温计时中，每100ms增加一次计数 */
                lysis3_timer++;
                /* 5分钟 = 300秒 = 3000个100ms */
                if (lysis3_timer >= 3000) {
                    /* 计时结束，进入第二阶段加热 */
                    lysis3_state = ZONE1_HEATING2;  /* LYSIS3_HEATING2 */
                    lysis3_timer = 0;
                }
                break;
                
            case ZONE1_HEATING2:  /* LYSIS3_HEATING2 */
                /* 第二阶段加热中，检查是否到达目标温度 */
                if (temp2 >= 94.0f) {  /* 到达94度认为接近目标温度 */
                    lysis3_state = ZONE1_HOLDING2;  /* LYSIS3_HOLDING2 */
                    lysis3_timer = 0;
                }
                break;
                
            case ZONE1_HOLDING2:  /* LYSIS3_HOLDING2 */
                /* 第二阶段恒温计时中，每100ms增加一次计数 */
                lysis3_timer++;
                /* 2分钟 = 120秒 = 1200个100ms */
                if (lysis3_timer >= 1200) {
                    /* 计时结束，停止加热 */
                    lysis3_state = ZONE1_COMPLETE2;  /* LYSIS3_COMPLETE */
                    lysis3_led_state = 3;  /* LED_BLINK_RED_GREEN */
                    lysis3_blink_count = 0;
                    lysis3_blink_state = 0;
                }
                break;
                
            case ZONE1_COMPLETE2:  /* LYSIS3_COMPLETE */
                /* 完成状态，保持LED状态 */
                break;
                
            default:
                lysis3_state = ZONE1_IDLE;  /* LYSIS3_IDLE */
                break;
        }
    } else {
        /* 不在3档或没有试管，重置状态 */
        lysis3_state = 0;  /* LYSIS3_IDLE */
        lysis3_led_state = 0;  /* LED_OFF */
        lysis3_timer = 0;
        lysis3_blink_count = 0;
        lysis3_blink_state = 0;
    }
}
